Re-10/Potential-simulation-for-initialization/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

#canCompile || exit 0    # Dynamic code

restore0Dir

#runApplication blockMesh

runApplication $(getApplication) #-withFunctionObjects -writePhi -writephi -writep

#runApplication postProcess -func streamFunction

#------------------------------------------------------------------------------
