Re-10/Potential-simulation-for-initialization/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14400;
        startFace       538036;
    }
    outlet1
    {
        type            patch;
        nFaces          3600;
        startFace       552436;
    }
    inlet1
    {
        type            patch;
        nFaces          3600;
        startFace       556036;
    }
    sphere1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          416;
        startFace       559636;
    }
)

// ************************************************************************* //
